"app.title" = "Mac Infos Système";
"cpu.title" = "CPU";
"cpu.usage" = "Utilisation : %.1f%%";
"cpu.cores" = "Utilisations des cœurs";

"ram.title" = "Mémoire";
"ram.usage" = "%.1f%% Utilisé";

"disk.title" = "Disque";
"disk.usage" = "%.1f%% Utilisé";

"network.title" = "Réseau";

"info.title" = "Informations Générales";
"info.host" = "Nom de l'ordinateur";
"info.model" = "Modèle";
"info.os" = "Système d'exploitation";
"info.processor" = "Processeur";
"info.ramTotal" = "Mémoire totale";
"info.diskTotal" = "Espace total";
"info.localIP" = "IP locale";
"info.publicIP" = "IP publique";
"info.temp" = "État de la température";

"button.settings" = "Réglages";
"button.quit" = "Quitter l'app";
"button.save" = "Enregistrer";
"button.close" = "Fermer";
"button.help" = "Guide d'utilisation";
"button.report" = "Créer un rapport";
"button.contact" = "Contactez-nous";
"button.showWindow" = "Mode fenêtre";
"report.title" = "Rapport Système";
"report.subtitle" = "Résumé des détails matériels et logiciels";
"report.hardware" = "Spécifications Matérielles";
"report.network" = "Informations Réseau";
"report.status" = "État Actuel";
"report.copy" = "Copier le Rapport";
"report.print" = "Imprimer";
"report.date" = "Date du Rapport";

"settings.title" = "Réglages";
"settings.general" = "Général";
"settings.advanced" = "Avancé";

"settings.view.title" = "Apparence";
"settings.view.showWindow" = "Afficher comme une fenêtre";
"settings.view.showCores" = "Afficher l'utilisation des cœurs";
"settings.view.showNetwork" = "Afficher la carte réseau";
"settings.view.showDisk" = "Afficher la carte disque";

"settings.monitor.title" = "Moniteur Système";
"settings.monitor.toggle" = "Arrêter / Démarrer la surveillance";
"settings.monitor.energyMode" = "Mode économie d'énergie";
"settings.monitor.refreshTime" = "Fréquence d'actualisation : %.1f s";
"settings.monitor.reset" = "Réinitialiser l'historique CPU & Réseau";

"settings.theme.title" = "Thème d'apparence";
"settings.theme.label" = "Thème";
"settings.theme.auto" = "Système";
"settings.theme.light" = "Clair";
"settings.theme.dark" = "Sombre";
"menu.startup.title" = "Démarrage";
"menu.startup.enable" = "Lancer à la connexion";
"menu.startup.disable" = "Désactiver le lancement à la connexion";

"temp.normal" = "Normal 🌡";
"temp.warm" = "Tiède";
"temp.hot" = "Chaud 🔥";
"temp.critical" = "Critique 🚨";
"temp.unknown" = "Inconnu";
"ip.loading" = "Chargement...";
"ip.notFound" = "Non trouvé";
"unknown" = "Inconnu";

"settings.language.title" = "Langue";
"settings.language.system" = "Par défaut du système";
"settings.language.restart" = "Veuillez redémarrer l'application pour que les changements de langue prennent effet.";

"help.title" = "Aide";
"help.subtitle" = "Sistem Bilgi – Guide des fonctionnalités et d'utilisation";
"help.version" = "Sistem Bilgi – Version 1.1  •  macOS 15+";
"help.developer" = "Développeur : ModelPC";

"help.cpu.title" = "Utilisation du processeur (CPU)";
"help.cpu.desc" = "Affiche l'utilisation du processeur en temps réel et son historique. Le graphique CPU suit les 30 dernières lectures. Devient rouge au-dessus de 80 % et clignote en guise d'alerte. Sur les processeurs multicœurs, activez l'utilisation par cœur via Réglages > Apparence > 'Afficher l'utilisation des cœurs'.";

"help.ram.title" = "Utilisation de la mémoire (RAM)";
"help.ram.desc" = "La somme des pages actives, inactives et câblées est calculée comme mémoire utilisée et affichée sous forme de pourcentage. La barre de progression bleue indique l'état actuel.";

"help.disk.title" = "Utilisation du disque";
"help.disk.desc" = "Affiche la capacité totale et l'espace utilisé de votre disque principal (/) en pourcentage. Vous pouvez masquer la carte Disque via Réglages > Apparence > 'Afficher la carte disque'.";

"help.network.title" = "Utilisation du réseau";
"help.network.desc" = "Affiche la vitesse totale de téléchargement + téléversement sur toutes les interfaces réseau en ko/s. Le graphique visualise les 30 dernières lectures sur une échelle dynamique. Masquez-le via Réglages > Apparence > 'Afficher la carte réseau'.";

"help.temp.title" = "État de la température";
"help.temp.desc" = "Le niveau thermique du système est lu via l'API macOS ThermalState : Normal 🌡, Tiède, Chaud 🔥 et Critique 🚨. Les valeurs exactes des degrés ne sont pas exposées aux applications tierces par Apple.";

"help.settings.title" = "Réglages & Personnalisation";
"help.settings.desc" = "Ouvrez les réglages à partir de l'icône de la barre de menus. Utilisez l'onglet Apparence pour activer/désactiver des cartes. Choisissez le thème Clair / Sombre / Auto dans l'onglet Avancé. Ajustez la fréquence d'actualisation entre 0,5 et 5 secondes. Le mode d'économie d'énergie réduit la fréquence d'actualisation en cas d'inactivité.";

"help.menubar.title" = "Barre de menus & Mode fenêtre";
"help.menubar.desc" = "L'application s'exécute par défaut dans la barre de menus. Activez la fenêtre autonome via Réglages > Apparence > 'Afficher comme une fenêtre'. L'étiquette de la barre de menus affiche le pourcentage CPU en direct et un mini graphique.";

"contact.title" = "Contact";
"contact.subtitle" = "Contactez le développeur ou suivez sur les réseaux sociaux";
"contact.email.title" = "Envoyer un e-mail";
"contact.email.address" = "info@modelpc.com";
"contact.email.address2" = "Développeur (modelpc91@gmail.com)";
"contact.social" = "Médias Sociaux";
"contact.social.youtube" = "YouTube";
"contact.social.github" = "GitHub";
"contact.social.x" = "X (Twitter)";
"contact.social.instagram" = "Instagram";
"contact.social.website" = "Site Web";
